["Okay, maybe it&#x27;s just me, but after reading the introduction and getting through the list of extremely difficult &quot;Can we...&quot; challenges followed by the &quot;We must...&quot; directives, the first quote that popped into my head was a variation of <i>“a poor man is crazy, but a rich man is just ‘eccentric.’”</i><p>I get the desire to solve the world&#x27;s ills, of society&#x27;s shortcomings, of essentially fixing the thousands of years of evolutionary programming to craft a utopia. What sane person would sit down and say &quot;You know, when I die, I want to leave the world a chaotic fireball of pain and suffering&quot; in all seriousness? Maybe I&#x27;m significantly jaded, but I hope I&#x27;m not the only one who finds such a letter a little bit narcissitic, brought to you by the originator of one of the most narcissitic platforms of the modern era, and hosted on that very platform, naturally.<p>&gt;<i>Our generation grew up in classrooms where we all learned the same things at the same pace regardless of our interests or needs.</i><p>This isn&#x27;t true at all. &quot;Our&quot; generation grew up with having to work to acquire knowledge. To spend time in the library. To sit down and read. To think. It took time, effort, opportunity, and personal investment - so much of which is no longer a priority now.<p>&gt;<i>The internet is so important that for every 10 people who gain internet access, about one person is lifted out of poverty and about one new job is created.</i><p>Citation needed. Like, really.", "Frankly, I find this is a very cynical approach to the lecture of this letter.<p>Most everyday Joes might not have the means to change the world but it is certain that when turn into billionaire, they rarely pledge the quasi-totality of their fortune to improve the well being of others.<p>If this is narcissistic, just let it be and be appreciate that for once, a great deal of money will be put to good use. The world is full of Koch Brothers, Saudi princes and European heirs to prove that most billionaires are more concerned about evading taxes rather than giving back.", "While Facebook is not doing everything it can to evade taxation in many countries, right? And let them choose what to do with the money. Why isn&#x27;t Zuckerberg pledging to drive his company as a good citizen?", "Don&#x27;t know about the Saudi princes however the Koch Brothers have given away millions of dollars (and I am sure there also give away money anonymously as well).<p><a href=\"http:&#x2F;&#x2F;www.kochfamilyfoundations.org&#x2F;foundationsdhk.asp\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kochfamilyfoundations.org&#x2F;foundationsdhk.asp</a><p>Also rest assured that Facebook also &quot;evades taxes&quot; in the same way that the Koch brothers do, that is by taking advantage of the US Tax Code in a legal way.  And none of us have any idea what the Koch Brothers have in their wills and have not publicly announced.", "As my mum used to say &quot;It&#x27;s easy to shit when your butt is full&quot;.<p>How hard is it, really, to give away 99% when you&#x27;re still left with enough to comfortably sustain 5+ lifetimes? Bill Gates said it well here: <a href=\"http:&#x2F;&#x2F;imgur.com&#x2F;gallery&#x2F;YDuoHdr\" rel=\"nofollow\">http:&#x2F;&#x2F;imgur.com&#x2F;gallery&#x2F;YDuoHdr</a><p>That said, I hope that if I ever get into a position like that, I too will be able to look beyond my personal greed and desire to increase the high score.", "I personally can&#x27;t stand this sort of thing because it conflates something personal&#x2F;intimate with a press release, and that&#x27;s just kinda gross to me.", "You&#x27;re saying that her daughter won&#x27;t get the warm fuzzies in 20 years time over a PR release veiled as a &quot;future note to our daughter&quot;? Me neither.", "Oh for sure, there&#x27;s a level of intimacy involved that, in a way, acts as a buffer against criticism.<p>To criticise the lovely sentiment would be like pointing out a child making a half-dozen spelling errors in their letter to Santa Claus.", "His Charity is so great- that He simultaneously saves the world&#x27;s poor while providing fodder for season 3 of Silicon Valley.", "Did someone say narcissist?  May I introduce you to: <a href=\"http:&#x2F;&#x2F;thelastpsychiatrist.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;thelastpsychiatrist.com&#x2F;</a>", "Whether or not the letter is narcissistic, one has to admire their initiative. It is not, unfortunately, the obvious thing to do, and they deserve to be applauded for that.<p>Whatever personal faults the man has, I&#x27;d argue this kind of philanthropy more than makes up for it.", "Exactly. Bill Gates came late to the game. He pretty much had to conquer the whole world before developing an interest in philanthropy. Now it&#x27;s his &quot;real work&quot; and I guarantee you he&#x27;ll be remembered more for that than MS-DOS!<p>Zuckerberg, like Gates, is a brilliant but deeply flawed person. However, Zuckerberg appears to be maturing much faster than Gates. I have lots of hope for him left.", "That&#x27;s fair, but if you notice a great deal of the letter is simply telling the child about the great achievements and dreams of the parents - if there&#x27;s one thing I&#x27;ve learned the hard way, it&#x27;s that dreams are easy to put into words and fuckin&#x27; hell on wheels to make reality. Philanthropy is a good social construct, for sure. I guess maybe I just have some inherent bias against preaching from atop the mountain of wealth inequality, a position that was obtained through a combination of luck and timing as much as any pure personal willpower and genius.", "I think you were right in your initial comment about being &quot;significantly jaded&quot;. The dude is literally trying as hard as he can to fix problems in the world but both your comments do little other than detract from his effort&#x2F;energy.", "What about the concrete initiative of just paying taxes in each countries where the real business is done?", "If you&#x27;re in the US and want to actually make the world better there are ridiculously more efficient ways to do so than handing your money to the government. Tax dollars paid in the US are probably more of a negative force in the world than a positive one when you consider the damage our military and corporate subsidies have done over the last 50 years.", "If Facebook were to pay taxes &quot;where the real business is done&quot; (assuming there is legal way to avoid doing so), it would probably be considered gross negligence. I imagine the same is true of any multinational.<p>Besides, Facebook can put that money to much better use than government. All the lowly users of Facebook on the other hand do not know how to best spend their money and had better hand it over. Zuck says so (so do Gates and Soros).", "Hmmmm. Is locking down the entire internet worth $45B?", "Man tries to help the world with his money and he&#x27;s greeted with criticism.", "Welcome to Hacker News.", "You&#x27;re right in that a lot of this is common sense. But I think the strength of the message is in making the implicit, explicit. It&#x27;s the same reason people suggest &quot;writing things down&quot; rather than letting thoughts&#x2F;plans live in your head. When times get tough, or things go sideways, you have a manifesto to fall back upon to keep your vision clear and to hold yourself accountable to your original intents.", "Does it matter whether or not he&#x27;s a narcissist or whatever reason why he does it? Or Gates or Buffet do?<p>I say bravo, and am looking forward to the benefits of giga-scale philanthropy.", "I dunno - careless philanthropy can cause more damage than the orginal problem.", "I sounded like a useless thing until he actually pledged the resources to do something. But it does indeed sound crazy, even if it is I hope that it does something positive for the world.<p>In some ways &quot;how can any two people actually have the power to fix so many problems&quot; is somewhat defeated by the fact that these two people have 45 billion dollars and not to mention plenty of influence.<p>There are plenty of people&#x2F;companies that seem to be working very hard to do make inequality worse so it&#x27;s nice to hear a powerful figure say that are somewhere from neutral to positive.", "It seems kind of strange that those people with this unfathomable multiple of normal people&#x27;s power and wealth talk about wanting to work towards equality.", "The internet does democratize access to information, but part of me thinks that for every job the internet created, Facebook destroys by wasting peoples collective time...", "&quot;I&#x27;m just going to quit my job &#x2F; school so I can go on Facebook all day!&quot;, said no one ever. Ten years ago, few people could boast that they could reach out to hundreds of people all at once; I&#x27;d not call that a waste of time.", "I would like to see the citation too.<p>Joke: in the late 80s, Stasi employed nearly 1 person for 50 people in East Germany. They just say they can do that 5 times better with internet, not impressive in 30 years of technical progress. Give us more!", "&gt;Our generation grew up in classrooms where we all learned the same things at the same pace regardless of our interests or needs.<p>What are honors classes? What are remedial classes?", "The variety and pace of public schooling is still very consistent when compared to the past practices or current alternatives (e.g. homeschooling, self-study, peer learning, tutelage).", "&gt; We will give 99% of our Facebook shares -- currently about $45 billion -- during our lives to advance this mission. We know this is a small contribution compared to all the resources and talents of those already working on these issues. But we want to do what we can, working alongside many others.<p>Ninety. Nine. Percent.", "I mean, what else are you going to do with $45 Billion? Build a really big house?<p>I&#x27;ve had the opportunity to rub shoulders with a few billionaires over the past few weeks, and it&#x27;s remarkable how differently they think about money than the people who don&#x27;t have it. Sure, they may buy a nice car (or jet), but after a certain level the only thing you can do with that kind of money is plug it back into something meaningful.<p>Hats off to Zuck and the other people who try to turn their success into something even greater than, well, their success.", "&gt;I mean, what else are you going to do with $45 Billion?<p>You are thinking about it the wrong way. You don&#x27;t spend $45B on <i>stuff</i> for yourself. You spend $45B on changing the way governments and populations live work and how power is balanced.<p>When Bud Fox asked Gordon Gekko &quot;How much is enough&quot; Gekko knew immediately that Fox wasn&#x27;t in the same league. Money isn&#x27;t about stuff, it&#x27;s about power and influence.", "Which is exactly the type of stuff Zuck is talking about here, although in less power-hungry ways. So you&#x27;re kind of proving @austenallred&#x27;s point.", "<i>although in less power-hungry ways</i><p>Yes, well that&#x27;s 100% the distinction.<p>The OP seems to think that the <i>obvious choice</i> is for money to &quot;go to something meaningful&quot; without specifying what &quot;meaningful&quot; actually is. Within this context, that would seem to mean the &quot;meaningful&quot; thing is &quot;greater -good&quot; charity. My point is that more frequently, this type of money go toward direct influence of power like setting up Super PACs, hosting power networks like Sun Valley Conference, establishing think tanks, grants to universities for certain research etc...", "I think Zuck is still power hungry, he&#x27;s just more veiled about it. Everyone with enough power (through money) wants to shape the world in their specific ideal.", "If we define &quot;power-hungry&quot; so broadly that it encompasses merely wanting to make the world a better place, I&#x27;m not sure what use the term is anymore.", "The problem is &quot;better&quot; is subjective, and its probably preferred that the majority of people determine what better is instead of the small minority of people with billions of dollars.<p>I like the future Bill Gates and Elon Musk want to bring. I do not like the future the Koch Brother&#x27;s envision.", "I&#x27;d go one better:<p>&quot;Everyone ... wants to shape the world in their specific ideal.&quot;<p>Most people give up on this idea in their mid-20s though or never really believe that they can.", "Exactly, when you have that much wealth, you buy things that don&#x27;t have price tags on.", "&gt;You spend $45B on changing the way governments and populations live work and how power is balanced.<p>$45B is even overkill for that.  Each presidential candidate spent (or had spent on their behalf) roughly $1B in 2012.  Zuckerberg therefore could have doubled a candidates spending for each presidential election for the rest of his life and still have half his fortune.  $45B is that huge.", "The Koch brothers have a combined $100BN and they still haven&#x27;t gotten the influence that they want. So yes, $45B is a shitload, but practically once you spread it out to where you need it to be to make the world look like you want it to, it still only makes a dent.", "The Koch brothers are the most influential political backers in the country and they spend somewhere in the neighborhood of  $200M per election cycle.  They are the closest someone has come to trying to buy an election, but even their donations are still only rounding errors in comparison to their overall fortune.  Politics is a relatively cheap game for someone with tens of billions of dollars.", "It is a cheap game for someone with millions of dollars even. ROI on these sort of political contributions can be absolutely insane. Apparently corporations on average receive ~$760 for every $1 spent influencing politics. Depending on the industry, ROI is anywhere from 5,000 to 77,000 percent.<p><a href=\"http:&#x2F;&#x2F;www.zerohedge.com&#x2F;news&#x2F;2015-03-16&#x2F;words-greatest-investment-every-dollar-spent-influencing-us-politics-corporations-ge\" rel=\"nofollow\">http:&#x2F;&#x2F;www.zerohedge.com&#x2F;news&#x2F;2015-03-16&#x2F;words-greatest-inve...</a>", "Spending money meaningfully is hard work. John D. Rockefeller had such a hard time with it that after awhile he just left it up to his son, who devoted his life to philanthropy.<p>At the Cleveland church he went to, significant portions of his time spent there was to write checks to parishioners.<p>I&#x27;d say it takes roughly the same amount of effort to spend money as it does to make it. You still need an organization, you still need to make really hard decisions day in and day out. It seems that there&#x27;s something fundamental about philanthropy that doesn&#x27;t scale.<p>Personally, I think the work a person does to earn that kind of money, assuming of course it&#x27;s from legitimate commercial activity, is plenty enough, one shouldn&#x27;t feel morally compelled to donate it back. But like you said, what else are you going to do with it? Doesn&#x27;t make a lot of sense anymore to leave billions to heirs.", "<i>&gt; Personally, I think the work a person does to earn that kind of money, assuming of course it&#x27;s from legitimate commercial activity, is plenty enough, one shouldn&#x27;t feel morally compelled to donate it back.</i><p>Agreed. And not to get too political, but I&#x27;m thankful that individuals in the U.S. <i>are</i> exceptionally generous, and <i>do</i> think about these things. And that those who DO earn copious amounts of money have the choice of what to donate it to - rather than having 90% of it confiscated and doled out by someone else who didn&#x27;t earn it.", "...Meanwhile, Samsung&#x27;s owner Lee Kun-Hee is still officially alive (even though nobody has seen him in months after he had a heart attack), because the company still hasn&#x27;t tied up all the loose ends for transferring the company&#x27;s ownership to Lee&#x27;s son while paying as little tax as possible.<p>So, yes, you can do a lot worse (to your society) with $$billions.<p>(Sorry for the rant.  Please carry on.)", "&gt; I&#x27;ve had the opportunity to rub shoulders with a few billionaires over the past few weeks, and it&#x27;s remarkable how differently they think about money than the people who don&#x27;t have it.<p>Yah, I don&#x27;t necessarily disagree with their mindset. I&#x27;ve crossed a lot of spectrums, including chilling and rubbing shoulders with the rich to scraping by. I definitely do agree with a lot of the lofty &#x27;moon shots&#x27; and some of these people have achieved remarkable things not just for themselves, but for society as well.<p>But, with Zuck, I just don&#x27;t know. Gates got rich off operating systems and crushing opponents at all costs (a success story for capitalism). Zuck, from advertising and selling &#x27;your&#x27; data. It&#x27;s admirable that he&#x27;s giving 99% away, but, I just don&#x27;t get a warm fuzzy feeling about it.<p>Time will tell and I hope it turns out good.", "I give Mark and Priscilla a lot of credit for this.  There&#x27;s a big difference between 50% and 99%.  There&#x27;s a big difference between leaving your children a few hundred million and many billions.  They have certainly exemplified the challenge to &#x27;&#x27;put your money where your mouth is&#x27;&#x27;.<p>Having said that, the first thing I thought of was the tax implications.  If the shares were to eventually be sold (but not donated), the State of California alone would earn roughly 6 billion dollars in tax revenue.  And the Federal Government another 13 - 15 billion.  Assuming a lot of variables that could push the value up or down, of course, and the fact that they would be unlikely to sell the majority of their shares any time soon.  My understanding is that by donating the appreciated stock to a charity, under current laws, there is zero tax due.  I wonder if there&#x27;s a state financial forecaster or analyst in Sacramento having a bad day today.", "&quot;There&#x27;s a big difference between 50% and 99%. There&#x27;s a big difference between leaving your children a few hundred million and many billions.&quot;<p>There is a saying &quot;you can name the price if I can name the terms&quot;. Zuckerberg saying this and when he actually does this are two different things. (Per my other comment). I am not saying that he won&#x27;t (how would I know?) but this is a promise that is based on a future event that, given the age of both parents, could easily be 50 or 60 years in the future.  And of course exactly nothing will happen if he changes his mind (he isn&#x27;t going to issue a press release on that) and nobody has any access to his finances anyway. So he is free to say anything he wants for any reason and that of course could change. That said it&#x27;s his money and he can do what he wants with it. And there is no reason to even announce this if not playing some PR angle.<p>Edit: And to my point I just got a WSJ Technology Alert email with the headline &quot;FACEBOOK&#x27;S MARK ZUCKERBERG IS GIVING AWAY 99% OF HIS SHARES&quot; and then further down in a paragraph &quot;over the course of their lives&quot;.", "&gt; Nonetheless the big winner here is the group of causes they donate to but it comes at the expense of a significant amount of tax revenue<p>Here is the world&#x27;s smallest fiddle...", "In this case it really does just sound like &quot;the tax incentive is working as intended&quot;.", "I might be wrong, but didn&#x27;t he already pay the massive tax bill for all of the stock options? Meaning all of those stocks would be taxed at long term capital gains rates, not at the high rates you are saying here. I believe his Federal taxes on sales would be 15% of current price - IPO price so approximately 4.5B not 13-15B at this time. That is also assuming Facebook continues to be dominant and doesn&#x27;t go the way of every other social networking site before it, but that is a different issue.<p>And either way, the charitable organizations deserve to be supported and will do good for society, and they get to pick how it is used. Which doesn&#x27;t seem like a bad thing, when the Federal government can barely agree on any budget at all.", "The current capital gains tax rate he would be avoiding is 20%, or $9b at today&#x27;s Facebook market cap. There is also a 3.8% Medicare tax added on that would come to another $1.7B. The state of California would also get their hands on it and take another 13.3% (or about $6B).<p>tl;dr Giving capital gains away is very tax advantageous!", "I did miss the Medicare Tax part yes, however he takes a $1 salary which would put his regular tax bracket at 10% and long term capital gains would be 0% to start and work his way up to 15%. As long as he doesn&#x27;t cash out $400k a year he never pays that 20%, and he shouldn&#x27;t need to ever. You also need to subtract IPO price from current price. Which is about going to drop those estimates about 35%. It still a big chunk of change, no doubt, but I have no problem with getting around it by going to charities. Especially when he already paid ~$2Billion in taxes for the stock at IPO time. The top 400 tax payers only payed $16Billion in 2009 so, he has paid a huge amount.", "I think that&#x27;s why they created a non-profit organization, Chan Zuckerberg Initiative. Non-profits are taxed differently and I&#x27;m sure they&#x27;ll figure out how to get the money where it needs to be and pay as little tax as possible.", "Is it possible in the US to take both names after marriage?<p>If so, I&#x27;m disappointed that Mark didn&#x27;t choose to be Zuckerberg-Chan.", "Yeah. I have an extended family member who took both names and a friend who opted to just take on his wife&#x27;s maiden name and dropped his. Another set of friends came up with a last name that was new to them both.<p>The hyphenating of both names is an interesting concept, but would in all practicality be a difficult thing to pass on after a few generations if it were the standard. Though maybe I&#x27;m not thinking thorough it properly.", "Neither of them changed their names.", "In the US you can change your name to anything. The guy can change just as the girl can but it is very uncommon for the guy to change his last name.<p>Honestly, why are you disappointed?", "&quot;Chan is a diminutive suffix; it expresses that the speaker finds a person endearing. Thus, using chan with a superior&#x27;s name would be condescending and rude. In general, chan is used for babies, young children, and teenage girls. It may also be used towards cute animals, lovers, and close friends. &quot;<p>It&#x27;s otaku humor.", "In Japanese ... his wife is ethnically Chinese.", "Doesn&#x27;t matter in the context of the joke. Has nothing to do with his wife, only &#x27;chan&#x27;.", "It&#x27;s possible to do anything with your band. I&#x27;m disappointed he didn&#x27;t choose Suckitwinkelvoss.", "They didn&#x27;t announce plans to sell immediately and given the timeframe, I&#x27;d imagine that selling&#x2F;transferring those shares will be done in the most tax-advantaged way possible.", "Besides taxes, selling 44.5 billion worth of shares would affect the share value negatively.  They will probably use some kind of derivative contract to get funds for the non-profit.", "I think his point of &quot;We must make long term investments over 25, 50 or even 100 years. The greatest challenges require very long time horizons and cannot be solved by short term thinking.&quot; is <i>extremely</i> important.<p>As someone doing research at a top university, I am constantly annoyed by short term vision and optimizing for publication number at all costs. This system is broken.<p>Alfred Sanger got 2 Nobel Prizes, and he spent a lot of time without publishing before each. Clearly something impossible to do these days.", "If you&#x27;re not already familiar, you might be interested in the Long Now. &quot;The Long Now Foundation hopes to provide a counterpoint to today&#x27;s accelerating culture and help make long-term thinking more common. We hope to creatively foster responsibility in the framework of the next 10,000 years.&quot;<p><a href=\"http:&#x2F;&#x2F;longnow.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;longnow.org&#x2F;</a>", "And on the other hand we have the public companies, lacking strong leadership, forced to look at quarterly returns.", "Well there are more research institutions competing for the same dollars so the only way they can differentiate is based on publications. A lot of science is derivative and collaborative.  Most important though it needs to be reproducible.  Starting there is priority #1.", "Is _top_ university an important distinction in this context?", "It actually is in my opinion. If the top, elite research institutes show these kind of problem, then we can expect it to be very prevalent in the rest of the field as well. As in, this isn&#x27;t some no name low tier school run by mediocre people.", "It was just to highlight that things are broken even at the top. I&#x27;ve worked all the way from a relatively small institution and I&#x27;ve found little correlation between long term vision and institution ranking, which is quite surprising.", "Implication is competition is paramount - both level and quality of output", "Now I don&#x27;t feel too bad about Fb snubbing Telegram. &#x2F;s<p>I&#x27;m curious how they plan to liquidate that shares as it will have quite some effect on the dynamics of Fb and on this:<p><pre><code>  I will continue to serve as Facebook&#x27;s CEO for many, many years to come</code></pre>", "Pledge during lifetime means that they have the flexibility to do the bulk of the liquidation during the latter years of their lives, when perhaps he has assumed only Chairman responsibilities.<p>Also, you can get loans at very low rates by putting shares into collateral. This is how Larry Ellison funds much of his endeavors.", "Will this ~$45 billion go to efficient use? Based on his track record of $100 million to newark and how effective that was, I am skeptical.<p>Good intentions in philanthropy are a dime a dozen, actual results are less common.", "Has it really been so big a failure as the press has led us to believe?<p><a href=\"https:&#x2F;&#x2F;www.facebook.com&#x2F;zuck&#x2F;posts&#x2F;10102461245925231\" rel=\"nofollow\">https:&#x2F;&#x2F;www.facebook.com&#x2F;zuck&#x2F;posts&#x2F;10102461245925231</a>", "Crazy. Even crazier when you realize that that 1% is $450 million....", "so Max will still be (half) a billionaire once she grows up.", "Assuming Facebook maintains it&#x27;s valuation.<p>Empires grow and empires crumble.", "Chances are at least 1% of their wealth will be put into something stable. Index funds, bonds, treasuries. Hell, cash&#x27;d be fine.", "Indeed. Bill Gates owns a railroad in Wisconsin, for example.", "Mr. Zuckerberg probably has other assets ;)", "So much for the three comma club.", "So she&#x27;ll be OK. Hope I&#x27;ll still be able to take care of my kids after Zuckerberg unleashes the flood of H1Bs to lower my salary.", "&quot;During our lives&quot; doesn&#x27;t specify a time frame such that it will happen in the next 5 years or 50 years. What he appears to be really saying is &quot;our heirs will only inherit 1% of our Facebook shares&quot;. Until both Chan and Zuckerberg pass away we don&#x27;t know how many shares (or wealth) they will have access to.", "It&#x27;s very probable Facebook will get a competitor, and&#x2F;or make a decision, that makes the company worth a lot less in a very short time, like its predecessors &#x2F; previous competitors did. Internet companies can be fickle like that. Mind you, it&#x27;s not likely to happen overnight and it also depends on how much the company&#x27;s value is based on thin air, but still.", "He&#x27;s still left with US$450 million, for living expenses...", "Yeah... how&#x27;s that for burying the lede? I almost didn&#x27;t get that far through the post.", "Keep in mind that it is of the Facebook shares value, not net worth. \nAlthough admirable, it is not apart of the Bill and Melinda Gates pledge that many billionaires (notably, Buffet) have taken of giving away half of their new worth before they die.<p>Anyway though, it&#x27;s still a lot. And I hope they follow what other billionaires have been doing; not just throwing it at charities, but putting it into research and even funding entirely new projects.<p>Funding startups and research labs that have no economic goal or an economic return to shareholders is something that is very needed. I see much of the funding coming from this.", "<i>&quot;Although admirable, it is not apart of the Bill and Melinda Gates pledge that many billionaires (notably, Buffet) have taken of giving away half of their new worth before they die.&quot;</i><p>Are you referring to The Giving Pledge [1]? Both Mark and Priscilla have signed it [2]:<p>&quot;We salute the Giving Pledge movement, and are proud to be part of its declaration that those who have been fortunate should give back at least half of their wealth during their lifetimes.&quot;<p>[1] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;The_Giving_Pledge\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;The_Giving_Pledge</a><p>[2] <a href=\"http:&#x2F;&#x2F;givingpledge.org&#x2F;pdf&#x2F;pledge-letters&#x2F;Zuckerberg_Letter.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;givingpledge.org&#x2F;pdf&#x2F;pledge-letters&#x2F;Zuckerberg_Letter...</a>", "&gt;Anyway though, it&#x27;s still a lot. And I hope they follow what other billionaires have been doing; not just throwing it at charities, but putting it into research and even funding entirely new projects.<p>You might be interested in reading about Chuck Feeney (the founder of Duty Free Stores), who was the original guy advocating for such hands-on charitable work.", "How much does he have outside of Facebook shares?  A billion or two?  So it&#x27;s still &gt;90% of net worth.", "That would leave him with $450 million left over.<p>Four hundred. And fifty. Million.", "He earned it.", "Chapeau Mr. and Mrs. Zuckerberg.", "At last Zuckerberg realized real problems of the world can&#x27;t be solved by Facebook or for that matter technology. I am talking about healthcare and medical problems. Personally websites like Facebook are wate of time and barely make ant impact in human potential improvement.They do make us feel worse and sell our personal data to advertisers though.", "There hasn&#x27;t been another other thing that has had as much impact in bringing me closer to my family and friends across the globe. Waste of time for you, positive life changing medium for me. Further, who know what positive impact this have had on my health? Maybe it has prevented the need for medicines in many cases.", "With the amount of money Zuk has he should start a non-profit drug maker that produces generic drugs at cost.", "Something&#x27;s always bugged me about relying on philanthropy as a source of funding the public good, as opposed to the public funding the public good through taxation and the democratic process: In the former case, the public doesn&#x27;t really have much of a say about where the help goes. We must rely on the judgment (and personal values) of a few rich people and hope they pick charities that maximize the benefit.<p>Would the outcome be better or worse if we had, say, a 99% tax bracket at &gt;$N million, and let the public decide the best way to deploy that funding via the ballot box? Would that process better align with the values of a democratic society? Or would we just get more corporate welfare, bombers and aircraft carriers?<p>I&#x27;m not ragging on philanthropy--it&#x27;s awesome that some of these billionaires understand the meaning of &quot;enough&quot; and choose to give away their fortunes to worthy causes. But is it best for society to leave it to a few lucky &#x27;elite&#x27; to judge what is and isn&#x27;t a worthy cause?", "You&#x27;re becoming too clouded in fuzzy ideals and missing the ugly reality that there is no virtuous public and democratic society, but the state. You say we must rely on the judgment and values of a few wealthy, but then completely ignore the whole landmine of public choice. Not that &quot;having to rely on a few rich people&quot; is even true.", "That&#x27;s a little nihilist.<p>Traditionally the state has been a form of wealth redistribution, because while it may not be a true democracy, citizens still vote, and could potentially vote to have the majority of the wealth redistributed equally amongst themselves.<p>But instead we have a power struggle between those with the means to sway others and the idealists.  While I&#x27;m sure the idealists will probably never attain their utopia, if they don&#x27;t continue to share their dream we&#x27;ll end up living someone else&#x27;s self-serving one.", "Mark Zuckerberg donated $100 million dollars to Newark public schools a few years ago, and they ended up no better for it (and arguably worse off).  Here&#x27;s a great article on the topic -- <a href=\"http:&#x2F;&#x2F;www.newyorker.com&#x2F;magazine&#x2F;2014&#x2F;05&#x2F;19&#x2F;schooled\" rel=\"nofollow\">http:&#x2F;&#x2F;www.newyorker.com&#x2F;magazine&#x2F;2014&#x2F;05&#x2F;19&#x2F;schooled</a> .<p>The main reason for the failure of the donation to create positive change was that the community wasn&#x27;t engaged at all in the reform process.  The first time Newark students and parents heard about the donation and the accompanying &quot;reforms&quot; were when Zuckerberg announced them on Oprah.<p>I completely agree with your sentiment, and wish philanthropy wasn&#x27;t seen as an unmitigated good thing.", "&gt; Would the outcome be better or worse if we had, say, a 99% tax bracket at &gt;$N million, and let the public decide the best way to deploy that funding via the ballot box?<p>If we had that <i>and</i> still had charitable deductions, I suspect <i>more</i> public goods would be funded by charity rather than public decision-making then is now the case, since the marginal cost of charity giving would be much <i>lower</i>.", "Hopefully you&#x27;re not the only one, as I share your reluctance to embrace it as the &quot;go-to&quot; model of social constructiveness. There&#x27;s a lot of good that comes from people &quot;giving back&quot; in one form or another, be it financial, skilled labor, or just simple time and attention when possible. I think it&#x27;s admirable to want to change &quot;institutions&quot; like education for the better - I&#x27;ve been an advocate for &#x27;progress&#x27; ever since I saw some of the challenges back in my own youth - but I can&#x27;t help but think of such experiments as pet projects. Those can be productive, sure, but do I believe, deep down, that the Chan Zuckerberg Initiative is going to have the answer to the variety of problems that plague Chicago&#x27;s South Side, New Orleans, or any number of troubled communities? Sigh, might just be me.", "I&#x27;d rather see them pay a considerable chunk of those billions in taxes - which Facebook and other giant companies like it don&#x27;t pay in the US due to its lax tax laws, and which they evade in other countries using various tax evasion schemes. Then there&#x27;d be more money to pay for affordable schools and whatnot.<p>Then again, the US is more likely to spend trillions on wars abroad without those really improving their own country, so on that note, it&#x27;s probably better for a philanthropist to invest the money in a charity with a singular goal, such as education or research.", "One difference is that billionaires (at least the Buffett &#x2F; Gates crowd) seem to put a lot more of their donations toward projects in foreign countries than the government would. Since the vast majority of people living in bad situations in the world are not Americans, I think it&#x27;s very plausible that they&#x27;re doing more good with the money than we would get from taxing it.", "So would &quot;the people&quot; know of a better way to deploy Zuckerberg&#x27;s fortune than the man himself?", "I feel only on HN and Reddit can people find reason to criticize a guy who is giving away billions of dollars for humanity. Talk about not seeing the forest for the trees.", "I think it&#x27;s a good sign if people don&#x27;t take words at face value and be critical of it.", "A public pledge to donate 45 billion dollars to charity within their lifetimes with an eye towards long term solutions deserves criticism?  Seriously, WTF?", "This seems more like PR than a genuine letter to a child. Which is fine, but I wish they&#x27;d treat it as such.<p>They talk about facebook, donations, improving the world, their beliefs, etc. but very little on how to be a better person or how to enjoy life. Maybe I&#x27;m projecting, but what would you want to find in your pillow after moving in for your first day of college?<p>I hope they wrote their daughter a real letter. One directed to her and not something that will be tweeted by hundreds of news organizations.", "Zuckerberg isn&#x27;t planning on retiring.<p>He will rival Bill Gates in the magnitude of philanthropic contributions.<p>And in other news Facebook Notes is challenging Medium as the default one-column publishing tool.<p>Note as well, that of all the immaterial goods that have the potential to create immense value to people and humanity, education and health are the ones strongly highlighted. Global equality is there, but to a critic this too will be seen as another factor in building and supporting an ever-growing, and long-living, consumerist middle class.<p>There is very little said about freedom, democracy, privacy, justice or self-determination. Even if this reading is unfair, cynical or simply too demanding of what this text and announcement is. Not to mention detracting from what is otherwise a highly admirable act.", "According to the Bill &amp; Melinda Gates Foundation&#x27;s financial declarations [0], assets as of December 2014 read at a hair under $45 billion. This very much rivals the size, even if it will take some time to build momentum and make as much of a difference as the Gates Foundation has to date.<p>[0] <a href=\"http:&#x2F;&#x2F;www.gatesfoundation.org&#x2F;Who-We-Are&#x2F;General-Information&#x2F;Financials\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gatesfoundation.org&#x2F;Who-We-Are&#x2F;General-Informatio...</a>", "I&#x27;m not trolling, as much as it will seem the opposite, but I feel compelled to wonder about postnatal mania (mild postpartum psychosis) as I read the letter. I wonder how different (or private) the letter may have been had it come four months from now.  I wonder how many really significant acts of charity and kindness by the super wealthy and influential occur in the days following childbirth. Just wondering aloud here.", "I&#x27;d imagine they had such a significant decision planned far before the kid was born.", "You would think there is significant PR-department oversight and long-term planning that went into this.<p>But on the other hand.. nobody really knows?", "Never much cared for Zuckerberg but this changes my perspective.<p>Off-topic: can Facebook please go ahead and literally kill the blogging industry by giving the ability for everyone to use these updated Notes section? As is, the majority of the referrer on the Internet is Facebook. They might as well get the blogs out of the way.", "&quot;As you begin the next generation of the Chan Zuckerberg family, we also begin the Chan Zuckerberg Initiative to join people across the world to advance human potential and promote equality for all children in the next generation. Our initial areas of focus will be personalized learning, curing disease, connecting people and building strong communities.<p>We will give 99% of our Facebook shares -- currently about $45 billion -- during our lives to advance this mission. We know this is a small contribution compared to all the resources and talents of those already working on these issues. But we want to do what we can, working alongside many others.&quot;", "Reading this is impossible to not to think of Bill Gates. Someone who realized the impact his money can have. Many people in this industry have been influenced by the actions of Gates, especially in the tech community. As a 20 something the money I make certainty pales in comparison to that of Gates or Zuckerberg, but even at a low rate for the tech industry it is much above that of my friends, many of who have worked much harder to get to where they are. It is difficult to be in a position to give help and refuse. Perhaps the effect Gates can have on the minds of the wealthy will be even greater than the already vast contributions he has produced.", "Just wow. I asked my parents how my birth changed their lives. They said they had to invest in some good ear plugs (for themselves) as a sleep aid, and that they lost a sock drawer until I graduated to the futon. While I did not spark the solving of the world&#x27;s problems, at least I did have some small impact.", "Mark has set some ambitious goals regarding poverty, disease, nutrition, and equality, and connectivity. I hope for all of our sake that he is successful in realigning many of the perverse short-term incentives through his and his Priscilla&#x27;s generous contributions and efforts.<p>I wish he had spoken more about luck and balance. This is something that Bill &amp; Melinda Gates, as well as Warren Buffet do very well. Understanding luck and balance is the key to empathy, which is also a phrase that is missing from this letter.<p>I also wish he had not marketed this press release as a letter to his daughter. Perhaps he has another, private letter that is actually more relevant and personal, but if I were Max, I probably wouldn&#x27;t be thrilled to read this 20 years down the road.<p>But I&#x27;m sure he had a reason to release this letter as he did, and that he thought for a long, hard time before penning these words. Best of luck to the new father, mother, and daughter.", "Most of these things can be achieved, but I really don&#x27;t understand what most people expect from equality.  For example, does equality mean that if I sit on my ass and do nothing, I get the same as the person next to me who works their butt off?  Or does it mean that I get a fixed amount based on the effort I put in?  How is that effort measured?<p>When people talk about equality, I&#x27;m not sure if they mean equal opportunity or equity or utopia (knowing that utopia depends on a slave class).  Maybe it means something else.<p>The reality is that humanity has empathy and greed (noting they are not opposites).  I can not imagine that I will ever see every person equally.", "First time I&#x27;ve heard of Facebook Notes, which apparently aren&#x27;t new at all. The notes that I do see aren&#x27;t styled the same way as Zuckerberg&#x27;s letter.", "I mean, technically, Facebook has had notes since the early days. I know the format and style has changed, but I remember writing &#x27;notes&#x27; on my wall that any friend could read in a dialogue box since around 2005&#x2F;2006 ish?<p>To that note, very few people I know actually use Facebook notes compared to other blogging platforms.", "It&#x27;s a new redesign: <a href=\"http:&#x2F;&#x2F;www.theverge.com&#x2F;2015&#x2F;9&#x2F;25&#x2F;9398895&#x2F;facebook-notes-redesign\" rel=\"nofollow\">http:&#x2F;&#x2F;www.theverge.com&#x2F;2015&#x2F;9&#x2F;25&#x2F;9398895&#x2F;facebook-notes-red...</a>", "Facebook has about 800 million features you would never know existed unless you went digging for them.", "Facebook notes were a huge part of the platform at first, died with expansion of the Newsfeed and the way statuses work now.", "All the notes I have seen lately have this same style.", "I&#x27;m dismayed by the lack of focus on the environment here.  Humans as a species are doing just fine. Health gains just marginally improve that. We need to focus on finding balance with nature that doesn&#x27;t involve mass extinctions and subjugation.", "I think this letter and <a href=\"http:&#x2F;&#x2F;givingpledge.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;givingpledge.org&#x2F;</a> are good.<p>But we all give away wealth when we die. To someone or another.<p>The pledge is not necessarily one of generosity other than looking past one&#x27;s family. Which is something, but less impressive along the generosity dimension than giving away more earlier (while that money has a very real opportunity cost to you).<p>That said, if I had billions of dollars, I&#x27;d be investing in my own research and not giving it away. But that&#x27;s just me.", "No pressure or anything. Love, Mom and Dad.", "Many wealthy citizens have only used their wealth to enrich themselves and their families. It is nice to see someone that is focused on making the world a better place.", "Every rich guy thinks he knows what&#x27;s good for the world. And why announce this together with the birth? Should the world celebrate this miraculous event that also led to our salvation?", "This is amazing. Money doesn&#x27;t make us live longer, but does $45 billion help bring the future sooner? I bet it does.  It will widen our horizons on what&#x27;s possible.  Everyone on earth will benefit from it.", "Hope many more will follow, my sincere admiration.<p>Here the SEC filling:\n<a href=\"http:&#x2F;&#x2F;www.sec.gov&#x2F;Archives&#x2F;edgar&#x2F;data&#x2F;1326801&#x2F;000132680115000035&#x2F;form8kdec2015.htm\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sec.gov&#x2F;Archives&#x2F;edgar&#x2F;data&#x2F;1326801&#x2F;0001326801150...</a>", "&gt; right now, we don&#x27;t always collectively direct our resources at the biggest opportunities and problems your generation will face.<p>One of the biggest problems facing kids in the west is digital addiction. Society as a whole is still collectively in denial here as adults gain from it, from parents who get some peace while the kids play with the iPad to game developers pushing out endless FarmVille clones attempting to get kids hooked enough to convince their parents to approve some in-app payments.<p>The problem is already there - just need to look at the amount of Ritalin being subscribed - <a href=\"http:&#x2F;&#x2F;www.theguardian.com&#x2F;society&#x2F;2012&#x2F;may&#x2F;06&#x2F;ritalin-adhd-shocks-child-psychologists\" rel=\"nofollow\">http:&#x2F;&#x2F;www.theguardian.com&#x2F;society&#x2F;2012&#x2F;may&#x2F;06&#x2F;ritalin-adhd-...</a>", "&gt; Today your mother and I are committing to spend our lives doing our small part to help solve these challenges. I will continue to serve as Facebook&#x27;s CEO for many, many years to come, but these issues are too important to wait until you or we are older to begin this work. By starting at a young age, we hope to see compounding benefits throughout our lives.<p>In other words, <i>I&#x27;m getting in on this philanthropy thing at a much younger age than Bill Gates</i>.", "&gt; Your generation will set goals for what you want to become -- like an engineer, health worker, writer or community leader.<p>Realistically, we can&#x27;t all avoid being garbage collectors or street sweepers, can we? Or will automation really replace all unsavoury jobs with high-paying professions?", "I have had some problems with the way his company operates sometimes but I can&#x27;t find a single thing he said I don&#x27;t emphatically agree with here. Hat tip, Mark Z.", "I find that I don&#x27;t agree with the whole thing. It just seems like a PR stunt to me :(\nWhy the fuck are you posting a letter to your daughter across the globe? Why do you have a letter at all, can you just say it to her sometime when she is actually able to understand.\nI guess for him completely different rules apply, but my wife and I don&#x27;t even post any pictures of our daughter online nor are we sharing anything about her. She should be able to decide herself, what she wants to put there, when she is able to…", "One good answer: It totally changed my perception of Facebook. If the guy at the top is trying to save the world, that automatically makes facebook a lot more appealing, not just to me and many other other I know who have historically been quite suspicious of facebook and its overly invasive privacy &#x27;features&#x27;.", "I guess we lucked out that our wealth proclaimed leaders are benevolent", "Pretty clear you didn&#x27;t read the thing. The guy just pledged to give away 45 Billion dollars to try and improve humanity in various ways. Seems like a pretty expensive &#x27;PR stunt&#x27;.", "from an evolutionary psychology standpoint, we are all driven to constantly increase our social value (and indirectly that of our offspring). once you hit a certain level of wealth, it is rational for you to shift your attention from making more money.  your social value is only increased by wealth up to a certain amount, after which the marginal returns in social capital approach zero for every additional dollar earned.  to put it simply, how much more social value do you have with $1 billion versus $2 billion?  The world is indifferent.  At that point, you are simply a rich person.<p>once you reach such an inflection point of wealth, you must find an alternative means of increasing your social capital.  there are two common ways: one is to demonstrate your evolutionary fitness in a field completely unrelated to how you amassed your wealth: many rich get into movie production, novel writing or other creative endeavor.  These usually fail.<p>another alternative, the safer alternative, is to expend your remaining time and resources advancing social causes (running for an elected office certainly falls under this category).  this is the simplest way for an adult, untrained in anything other than their primary business, to increase their social capital.<p>it&#x27;s not a coincidence that zuck is still willing $450mm to his offspring--more than enough to hit that inflection point.  he knows that any additional dollar beyond that inflection point provides marginal social value to his offspring.", "Well, I&#x27;ll say that I appreciate the effort on Zuck&#x27;s part, but somehow I still can&#x27;t make myself like the guy :\\<p>Oh well, I guess I don&#x27;t have to like him to appreciate that kind of cash going into worthy causes.", "Okay yeah there might be a lot of flaws or criticisms about this, but at the end of the day, this is a net win for society. Go Mark and Priscilla!", "He just put his baby into the public eye; now it&#x27;s paparazzi bait like some Prince&#x27;s kid in England", "This leaves a bad taste in my mouth, for some reason. Must one&#x27;s private life be this public? I get that Zuckerberg doesn&#x27;t agree with privacy, but surely putting his daughter in the public limelight as soon as she is born is an imposition on her privacy.<p>Maybe I&#x27;m just getting old.", "I see you have some downvotes but I came here to say the same thing. Zuck is using the birth of his daughter to advertise a new venture.<p>You want to be generous? Great, do it!<p>Telling us in a letter to your daughter as a hook to attract eyeballs is kind of weird and exploitative.<p>Update: I also thought I should say that this is no big deal, he has some different ideas about what&#x27;s ok and what&#x27;s not and I see that every day, I&#x27;m not mr perfect either.<p>I guess the reason it&#x27;s interesting in this case is because he is head of facebook and entrusted with a lot of people&#x27;s personal information. If his judgment is different to mine then I don&#x27;t feel comfortable entrusting him with my social life.", "Facebook is his thing, and he wants people to be public and share by default. So he is leading by example.", "I would like to draw your attention to the time when the fb hit the privacy scandal and it was brought to light that the founder and CEO was too privacy conscious and shared little to nothing on his site.<p>May be I&#x27;m too cynical as I see that there was a conscious effort to post more updates. Recently I see another shift following the Internet.org initiative.", "I am in your camp. I cannot even say that our culture is different, plenty of people fillin up FB with photos of their kids, but this just looks so wrong to me.\nAnd in this case, some mix of PR and bragging.", "With you littletimmy. I couldn&#x27;t read it after first few lines.", "Interesting how internet connectivity is mentioned without a reference to internet.org after that got a lot of net-neutrality heat. Regardless, great to see so much money being invested in so many great causes.", "This is very admirable. Hats off to Mark Zuckerberg. Very well done!", "A great read indeed, plus a nice picture.\nI&#x27;m going to print out this and read along with my next generation.<p>I&#x27;m thinking about starting to use facebook again, left it a few years ago.", "Seems that Zuck succeeded. So now all he has to do, to gain the old users who didn&#x27;t agree with Facebook policies, to post cute family notes.", "It&#x27;s a trap.", "This is really cool. I kind of missed notes in Facebook. How do you create one?", "The &quot;Notes&quot; app in the sidebar.", "When I read this stuff (as in the letter) I just think one thing:<p>You guys are so full of yourselves.", "These opinions really are going to have an influence on the entire industry.", "&quot;Medicine has only been a real science for less than 100 years, and we&#x27;ve already seen complete cures for some diseases and good progress for others.&quot;<p>Thats a bit unfair. Scientists have been painfully working to advance the field of medicine for centuries.", "Unless you have a very loose sense of the word scientist, that&#x27;s very much untrue.<p>[1]<a href=\"http:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pmc&#x2F;articles&#x2F;PMC2641521&#x2F;?page=1\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ncbi.nlm.nih.gov&#x2F;pmc&#x2F;articles&#x2F;PMC2641521&#x2F;?page=1</a>", "I think &quot;real science&quot; refers to reproducibly, experimentally driven science.", "Arab scientists were performing reproducible and successful removal of cataracts 800 years ago. Surely thats &#x27;real medicine&#x27;.", "Doctors have been working to advance the field for centuries certainly but for pretty much all of them science by any reasonable definition wasn&#x27;t involved in the process.<p>Evidence-based medicine (what else would it be based on?) is actually a thing and an uncomfortably recent one at that.", "Expensive shot at Bezos and his distate of charity. Well played, Zuck.", "How is this at all related to Bezos?", "Wow, that&#x27;s a lot of pro-facebook comments for a &quot;Hacker news&quot; site. Shouldn&#x27;t you people be browsing reddit or better yet, facebook?", "Some thoughts:<p>* Addressing a public press release to your private child&#x27;s name<p>* Naming the initiative with your family&#x27;s name<p>* Calling for &quot;change now&quot; as if the world isn&#x27;t already working very hard every day towards progress<p>* Looks like a move out of a strategic playbook some advisers gave for &quot;how to be President someday&quot;<p>* Looks like they&#x27;re marketing themselves as the royal family, like Facebook is the new kingdom<p>* Looks like that smug thing that&#x27;s hip today where people compete to be most charitable<p>* Reminds me of the Melinda and Bill Gates thing, and the Google medical research thing<p>Part of this is the perspective of engineers who believe everything is solvable if you just build something to do it. If it isn&#x27;t built yet, it must be because we&#x27;re not working hard and fast enough. That if someone has billions of dollars, and are just willing to fund an initiative, they can take credit for curing all disease.<p>Part of it is the fear that&#x27;s faced by people who felt invincible when they become old, or have a newborn infant. When you can purchase anything, the new difficulties are things like bacteria, viruses, and entropy. When you are a god in the eyes of the society and economy, yet a worm in the eyes of biology and ecology, there&#x27;s no longer a clear path towards how to solve your daily concerns. If you&#x27;re poor and need food, there&#x27;s simple steps you can follow to acquire what you need. But when you&#x27;re wealthy, what do you do to get well from illness, to escape the pains of aging?<p>These people, and much of the digital society today, need perspective and psychological understanding beyond what they have. But you won&#x27;t see an initiative for that.", "<a href=\"https:&#x2F;&#x2F;www.facebook.com&#x2F;chanzuckerberginitiative&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.facebook.com&#x2F;chanzuckerberginitiative&#x2F;</a><p>&quot;Please log in to continue.&quot;<p>Seriously? One might think they would prioritize raising awareness over increasing Facebook userbase.", "It works if you disable XHR on the page (yes, really).", "This sounds like a bug. How do you repro this? I started on the note when logged out and clicking &quot;Chan Zuckerberg Initiative&quot; brought me to that page with no dialogs about logging in.", "Adorable baby girl, welcome to the world.<p>PS: <i>stress</i> and toxicity quite often are the real causes whereby the few diseases Mark mentioned is a consequence.", "Thanx Mark. Now that your CIA financed endeavour became a money making machine, you find it is about time to contribute some sort of &quot;philanthropy&quot; to the world. It is no wonder the millions of  serfs don&#x27;t waste any time to congratulate you on this great action of yours. Please, a word from the world to American based institutions: Please, stop saving the world. Really, look at what your government is doing to Syria, etc supporting terrorists through CIA controlled channels. \nAnd for God&#x27;s sake! Read the reports from World Bank before posting this &quot;i will save the world&quot; letter: Poverty and inequality have risen during the last years, not decreased!"]